"""
如果想传递不可被篡改的话，就用到了元组
tuple 元组  一旦定义完成就不能被修改，可以理解为只读的list
"""
# 一、元组定义：定义元祖使用小括号，使用逗号隔开每个数据，数据可以是不同的数据类型
# 1.1定义元组字面量
# 语法: (元素,元素...,元素)
# 1.2定义元组字量
# 语法: 变量名称 = (元素,元素...,元素)
# 1.3 定义一个空元组
# 方式一: 变量名称 = ()
# 方式一: 变量名称 = tuple()
t1 = ("1", True, 2)
t2 = ()
t3 = tuple()
print(f"t1的类型是：{type(t1)},内容是：{t1}")  # <class 'tuple'>
print(f"t3的类型是：{type(t3)},内容是：{t3}")
print(f"t2的类型是：{type(t2)},内容是：{t2}")
# 注意：
# 1.4 定义只有一个元素的元素，后面必须带有逗号，否则不是元组类型，str
t4 = ('hello',)
print(f"t4的类型是：{type(t4)},内容是：{t4}")

# 2.元组的嵌套
t5 = (('hello',), (1, True, "2"))
print(f"t4的类型是：{type(t5)},内容是：{t5}")

# 3 下标索引取出内容，依旧使用[]
print(t5[1][2])

# 4 元组的操作：index、count、len
# 4.1 元组的操作：index查找方法
t6 = ("去哪儿网", "携程", "同城")
index = t6.index("去哪儿网")
print(f"在元组t6中查找去哪儿网，的下标是：{index}")
# 4.2 元组的操作：count统计方法
t7 = ("去哪儿网", "携程", "同城", "飞猪", "12306", "去哪儿网")
num = t7.count("去哪儿网")
print(f"在元组t7中统计去哪儿网的数量有：{num}个")
# 4.3 元组的操作：len函数统计元组元素数量
t8 = ("去哪儿网", "携程", "同城", "飞猪", "12306", "去哪儿网", "OTA")
num = len(t8)
print(f"t8元组中的元素有：{num}个")

# 5 元组的遍历：while
index = 0
while index < len(t8):
    print(f"while循环，元组的元素有：{t8[index]}")
    # 至关重要
    index += 1

# 6 元组的遍历：for
for element in t8:
    print(f"for循环，元组的元素有：{element}")

# 如果修改元组会怎样？报错 TypeError: 'tuple' object does not support item assignment(不支持重新分配)
# 修改元组内容
# t8[0] = "中国南方航空"

# 定义一个元组，元组中有list，可以修改元组中list里的元素
t9 = (1, 2, ["去哪儿网", "携程"])
print(f"t9的内容修改前是：{t9}")
t9[2][0] = "南航"
t9[2][1] = "国航"
print(f"t9的内容修改后是：{t9}")
